app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "David Shapiro"], ["email", "davidshapiro@brandeis.edu"], ["created_at", "2022-10-07 00:26:00.834547"], ["updated_at", "2022-10-07 00:26:00.834547"], ["password_digest", "[FILTERED]"]]
---
  def create
    @user = User.new(user_params)
    if @user.save